# задание 1
print("Задание 1:")


x = 46
y = 34
print("Переменная \"x\" -", x)
print("Переменная \"y\" -", y)
print("Сумма:", x+y)
print("Разность:", x-y)
print("Произведение:", x*y)
print("Возведение степени:", x**y)
print("Деление по модулю:", x%y)
print("Целочисленное деление:", x//y)

#Задание 2
print("Задание 2:")
a=17/2*3+2==(17/2)*3+2
print("Ответ 1: 17/2*3+2=(17/2)*3+2:", a) #ответ 1

b=2+17/2*3==2+(17/2*3)
print("Ответ 2: 2+17/2*3=2+(17/2*3):", b) #ответ 2

c=19%4+15/2*3==(19%4)+(15/2*3)
print("Ответ 3: 19%4+15/2*3=(19%4)+(15/2*3):", c) #ответ 3

e=(15+6)-10*4==(15+6)-(10*4)
print("Ответ 4:(15+6)-10*4=(15+6)-(10*4):", e) #ответ 4

d=17/2%2*3**3==(17/2%2)*(3**3)
print("Ответ 5: 17/2%2*3**3=(17/2%2)*(3**3):", d) #ответ 5

#Задание 3
print ("Задание 3")
x = -10
y = 3

result = (abs(x) - abs(y)) / (1 + abs(x*y))

print ("Ответ:", result)

